Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: སྒྲག་པར་འགྱུར་བའི་ལྷ་དང་། ལྷ་མ་ཡིན་དང་། དྲང་སྲོང་སྤ་གོང་བ་ཐམས་ཅད་དང་། རྒྱ་མཚོ་ན་གནས་པའི་ཀླུའི་རྒྱལ་པོ་ཐམས་ཅད་དང་།
en: The ṛṣis cowered, and so did all the nāga kings who live in the great oceans.

source: ཆུ་བྲན་ཐམས་ཅད་དང་།
en: All the nāgas who send rain were shaken.

source: ལྷ་དང་། ཀླུ་གང་དག་ཆུ་ན་གནས་པ་ཐམས་ཅད་དང་། རྒྱ་མཚོ་ཆེན་པོའི་ལྷ་དང་། ལྷ་གང་དག་ལང་ཀའི་གྲོང་ཁྱེར་ན་གནས་པ་ཐམས་ཅད་དང་། རིག་སྔགས་འཆང་འཁོར་ལོས་སྒྱུར་བ་ཐམས་ཅད་དང་།
en: The gods and nāgas who live in water became agitated, as did the gods who live in the great oceans or on the island of Laṅkā.

source: གང་དག་གནས་གཙང་མའི་རིས་ཀྱི་ལྷ་རྣམས་དང་། ནམ་མཁའི་ལྷ་ཐམས་ཅད་འཁྲུགས་པར་གྱུར་ནས་ནམ་མཁའ་ལས་བབས་ཏེ། བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་དང་བྱང་ཆུབ་སེམས་དཔའ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དེ་ལ་ཡང་མཆོད་པའི་ཕྱིར། ལྷའི་མེ་ཏོག་རྣམ་པ་སྣ་ཚོགས་པདྨ་དང་། ཀུ་མུ་ད་དང་།
en: The vidyādhara emperors, the gods of the Pure Abode, and the deities who live in space, all gathered in the sky and rained upon Potala Mountain divine flowers, including various white, pink, and blue lotuses, as well as water lilies and the celestial mandārava and great mandārava flowers in vivid colors.

source: ཨུཏྤལ་དང་། པུཎ་ཌ་རཱི་ཀ་དང་། མན་དཱར་བ་དང་། མན་དཱ་ར་བ་ཆེན་པོའི་ཆར་དང་། ལྷའི་རྒྱན་དང་ལྷབ་ལྷུབ་ཀྱི་ཆར་པུས་མོ་ནུབ་ཙམ་རི་བོ་པོ་ཊ་ལར་ཕབ་སྟེ།
en: They also sent showers of divine ornaments and adornments upon Potala Mountain.

source: ལྷའི་སིལ་སྙན་དང་།
en: They knelt down to honor the Blessed One and played their celestial instruments in order to worship the noble bodhisattva Avalokiteśvara.

source: གླུ་དབྱངས་ལེན་ཅིང་ཧ་ཧ་ཞེས་ཅ་ཅོ་དང་ག་ཞའི་སྒྲ་བཏོན་ནས།
en: They uttered loud cries of joy and lavished gifts upon him.

source: བཅོམ་ལྡན་འདས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་རིག་སྔགས་འཆང་ཆེན་པོ་འདི་བཤད་དོ་ཞེས་ཆེད་དུ་རྗོད་པ་ཆེད་དུ་བརྗོད་དོ།
en: This great vidyā was taught by Noble Lord Avalokiteśvara in order to benefit all beings.

source: །དེ་ནས་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ཕྱག་ན་རྡོ་རྗེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གང་ན་བ་དེར་སོང་སྟེ། ལན་གསུམ་བསྐོར་བ་བྱས་ནས་མཆོད་པའི་ཕྱིར་མུ་ཏིག་གི་དོ་ཤལ་བརྒྱ་སྟོང་རི་བ་ཕུལ་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་རིག་སྔགས་ཆེན་པོའི་ཆོ་ག་ཞིབ་མོ་ཐམས་ཅད་ཀྱི་མཆོག་བཤད་དོ།
en: Vajrapāṇi, the great yakṣa general, then approached the great being, the noble bodhisattva Avalokiteśvara, circumambulated him clockwise three times, and honored him by covering him in hundreds of thousands of tiny strings of pearls while saying, “This great vidyā that you taught, Lord, is supreme for all rites.

source: །དོན་ཡོད་པའི་ཞགས་པའི་རྒྱལ་པོ་རིག་སྔགས་ཆེན་པོའི་སྙིང་པོ་འཇིག་རྟེན་མགོན་པོ་ཐུབ་པ་ཆེན་པོས་བཤད་དུ་གསོལ།
en: This great vidyā, O great sage and lord of the world, is in essence Amogharāja.

source: བཅོམ་ལྡན་འདས་ཆོ་ག་ཞིབ་མོ་མཐའ་དག་དོན་ཡོད་པའི་རྒྱལ་པོ་གྲུབ་པའི་མཆོག་ལས་ཐམས་ཅད་གྲུབ་པ་བཤད་དུ་གསོལ།
en: Please teach, Lord, the entire rite that brings the supreme amogha accomplishment! Please explain the auspicious accomplishment of all activities!”

source: དེ་ནས་དེའི་དོན་དུ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་ཆོ་ག་ཞིབ་མོ་གྲུབ་པ་དོན་ཡོད་པ། རིག་སྔགས་ཀྱི་རྒྱལ་པོ་རས་ཀྱི་སྐུ་གཟུགས་བསྒྲུབ་པའི་མཆོག །
en: Noble Lord Avalokiteśvara replied, “I will now teach the rites of Amoghasiddhi, the heart essence of Amoghapāśa, that constitute the practice procedures for the king of vidyās.

source: ཆོ་ག་དང་ཡོ་བྱད་དུ་བཅས་པ་བཤད་པ།
en: First is the excellent procedure for painting. “

source: རས་གྲུ་བཞི་པ་ཀུན་ནས་ཆ་ལེགས་པར་ཕྱེ་བ།
en: The vidyā holder should procure a rectangular piece of cloth, symmetrical in shape.

source: ཁ་ཚར་མ་བཅད་པ་སྐྲ་མེད་པ།
en: It should have an untrimmed fringe and be free of hairs.

source: རི་མོ་མཁན་གཙང་མ་ཁྲུས་བྱས་པས་གོས་གཙང་མ་བགོས་ལ་གསོ་སྦྱོང་དང་ལྡན་པར་བྱས་པས།
en: The painter should be ritually pure and bathed clean, wear clean clothes, and observe a ritual fast.

source: ཚོན་ལྷག་མ་མ་ཡིན་པ་སྣོད་སར་པར་བཞག་ལ་བྲི་བར་བྱ་སྟེ།
en: He should use uncontaminated paints in new containers.

source: དབུས་སུ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་རལ་པའི་ཐོར་ཚུགས་ཀྱིས་བཞུགས་ཤིང་། རྒྱལ་བ་འོད་དཔག་མེད་ཀྱིས་བརྒྱན་པ་ཐོར་ཚུགས་ཀྱི་གཡས་སུ་ཟླ་ཚེས་ཀྱིས་བརྒྱན་པ།
en: In the center of the painting, he should draw the noble lord Avalokiteśvara adorned with the victorious Amitābha as a crest jewel atop his topknots. His right head should also be adorned with the crescent of the new moon.

source: རི་དགས་ཨེ་ནེ་ཡའི་པགས་པ་གྱོན་པ། ཕྱུགས་བདག་གི་ཆུ་ལུགས་འཆང་བ། རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ།
en: Avalokiteśvara should be drawn wearing a black antelope skin and attired like Paśupati with all his ornaments.

source: དབུ་གསུམ་སྤྱན་གསུམ་ཕྱག་བཞི་པ།
en: He has three heads, three eyes, and four arms.

source: རིའི་སྟེང་ན་པདྨའི་གདན་ལ་བཞུགས་པ།
en: He sits on a lotus seat on top of a mountain. “

source: ཞལ་དབུས་མ་ཞི་བའི་ཞལ་བཞིན་འཛུམ་པ།
en: His middle face is peaceful and smiling.

source: ཞལ་གཡས་པ་འཇིགས་སུ་རུང་བ་ཁྲོ་གཉེར་ཅན། ཐོར་ཚུགས་འོད་དཔག་མེད་ཀྱིས་བརྒྱན་པ། དབུ་ཟླ་ཚེས་ཀྱིས་བརྒྱན་པ།
en: The face on the right is angry and frowning and is adorned with Amitābha as its crest jewel and with the crescent of the new moon.

source: ཞལ་གཡོན་པ་འཇིགས་སུ་རུང་བ་བཞིན་བསྒྱུར་ཅིང་མཆེ་བ་གཙིགས་པ། རྒྱལ་བ་འོད་དཔག་མེད་དབུལ་བཞུགས་པ།
en: The face on the left is angry and grimacing with protruding fangs; it has Amitābha above it.

source: ཕྱག་གཅིག་ན་པདྨ་ཐོགས་པ། གཉིས་པ་རྩེ་གསུམ་ཐོགས་པ།
en: In his first hand, Noble Avalokiteśvara holds a lotus, with the second a trident, and with the third the unfailing noose.

source: གསུམ་པ་དོན་ཡོད་ཞགས་པ་སྐུའི་ཕྱེད་ན་འཛིན་པ་ལ། བཅོམ་ལྡན་འདས་ཞལ་ཁྲོ་གཉེར་ཅན་དོན་ཡོད་ཞགས་པའི་ཕྱག་རྒྱ་བཅིངས་པའི་ཕྱག་ལ་སྤྱན་གཏོད་པར་བྱ་ཞིང་།
en: The Lord’s frowning face looks at the hand holding the unfailing noose, which is raised up to the middle of the body.

source: བཞི་བ་དབུགས་འབྱིན་པའི་ཕྱག་ཏུ་བྱ་ཞིང་འོད་འདོམ་གང་བ་ཁོར་ཡུག་འབར་བ་དང་ལྡན་པར་བྱའོ།
en: The fourth hand displays the gesture of giving comfort. He is enveloped by a blaze of light, with the halo extending half of a fathom in all directions. “

source: །གཡས་ཕྱོགས་ན་ལྷ་མོ་སྒྲོལ་མ་འགྱིང་བག་དང་བཅས་ཤིང་ལུས་བཏུད་པར་མཆོག་སྦྱིན་པའི་ཕྱག་ལ་མིག་གཏོད་པར་བྱའོ།
en: To the right of Noble Avalokiteśvara is the goddess Tārā. She is modest in her demeanor, her body is slightly bent, and she is looking at the hand displaying the boon-granting mudrā.

source: །གཡོན་དུ་པདྨའི་རིགས་མཛེས་མ་འཛེམ་བག་དང་བཅས་པ་གསང་སྔགས་ཀྱི་ཚུལ་དང་རྗེས་སུ་མཐུན་ཞིང་དོན་ཡོད་པའི་ཞགས་པ་ལ་མིག་གཏོད་པར་བྱའོ།
en: To the left of Noble Avalokiteśvara, the vidyā holder should draw Padmasundarī. She is modest in her demeanor, with an accommodating attitude of respect. She is looking at the hand that holds the unfailing noose. “

source: །ལྷ་མོ་སྒྲོལ་མའི་བར་དུ་གནོད་སྦྱིན་མོ་རལ་པ་གཅིག་མ་བྱའོ། །པདྨའི་རིགས་མཛེས་མའི་བར་དུ་ཁྲོ་གཉེར་ཅན་བྱའོ།
en: The rākṣasī Ekajaṭā should be drawn next to the goddess Tārā, and Vimalagati next to Padmasundarī.

source: །ཕྱོགས་གཉིས་པར་ལྷ་མོ་དཀར་མོ་ལག་ན་པདྨ་ཐོགས་པ་བྱའོ།
en: Bhṛkuṭī should be drawn above Tārā, with Śvetā on the other side holding a lotus in her hand.

source: །པདྨའི་རིགས་མཛེས་མའི་འོག་ཏུ་ཕོ་ཉ་མོ་གསང་སྔགས་ཀྱི་རྗེས་སུ་འབྲང་བར་བྱའོ།
en: Kṛtyā should be drawn, in accordance with the mantra tradition, below Padmasundarī.

source: །རལ་གཅིག་མའི་འོག་ཏུ་ལྷ་མོ་ཆེན་མོ་འཇིགས་བྱེད་མ་བྱའོ།
en: Bhīmī should be drawn below Ekajaṭā.

source: །གང་དུ་གནས་གཙང་མའི་རིགས་ཀྱི་ལྷའི་བུ་དང་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། ཁྱབ་འཇུག་དང་། དབང་ཕྱུག་ཆེན་པོ་མེ་ཏོག་སྣ་ཚོགས་ཐོགས་ཏེ་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱེད་པར་བྱའོ།
en: Above Noble Avalokiteśvara, the vidyā holder should draw the gods of the Pure Abode, including Śakra, Brahmā, Viṣṇu, and Maheśvara, all holding various flowers and worshiping the Lord.

source: །འོག་ཏུ་རྒྱལ་པོ་ཆེན་པོ་བཞི་བྱའོ།
en: Below them, he should draw the Four Great Kings.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་འོག་ཏུ་འཕགས་པ་ཕྱག་ན་རྡོ་རྗེ་འཇིགས་སུ་རུང་བ་གད་རྒྱངས་ཅན་ཁྲོ་བོ་དོན་ཡོད་པའི་རྒྱལ་པོ་དང་སྨྲ་བ་བྱའོ།
en: Below Noble Avalokiteśvara, he should chant the mantra of Amogha­rāja­krodha and draw Noble Vajrapāṇi in his wrathful form that laughs wildly. “

source: །རས་ཀྱི་སྐུ་གཟུགས་འདི་མཐོང་བ་ཙམ་གྱིས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་རི་བོ་པོ་ཊ་ལ་ན་གཞལ་མེད་ཁང་དང་བཅས་པ་མངོན་སུམ་དུ་མཐོང་བར་རིག་པར་བྱའོ།། །།འཕགས་པ་དོན་ཡོད་པའི་ཞགས་པའི་ཆོ་ག་ཞིབ་མོའི་རྒྱལ་པོ། བམ་པོ་བཅུ་པ།
en: It should be known that by merely looking at this painting, one will behold the true and real Noble Avalokiteśvara, his fine palace, and Potala Mountain with one’s very eyes.

source: མཐོང་བ་ཙམ་གྱིས་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་བརྒྱད་ལས་ཐར་བར་འགྱུར། འཇིགས་པ་ཆེན་པོ་བརྒྱད་ལས་ཡོངས་སུ་གྲོལ་བར་འགྱུར།
en: By merely seeing the painting, one will be saved from the eight great hells and the eight great fears.

source: མཚམས་མེད་པ་ལྔ་བྱེད་པ་ཡོངས་སུ་ཐར་བར་འགྱུར།
en: One will also be freed from the results of the five acts of immediate retribution.

source: དམ་པའི་ཆོས་སྤོང་བ་དང་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་སྤོང་བས་མཐོང་བ་ཙམ་གྱི་མོད་ལ་རྣམ་པར་དག་པར་འགྱུར། མནར་མེད་པ་ལ་གཞོལ་བའི་མཐར་ཐུག་པ་ཡང་ཡོངས་སུ་གྲོལ་བར་འགྱུར་རོ།
en: By merely seeing the painting, someone who had rejected the true Dharma and all the buddhas and bodhisattvas will be completely purified and saved from the imminent rebirth in the Avīci hell that would otherwise occur immediately after their death. “

source: །ཚངས་པ་ཆེན་པོའི་བསོད་ནམས་བརྒྱ་སྟོང་གི་དགེ་བའི་རྩ་བ་བསྐྱེད་པར་འགྱུར།
en: Those who behold the painting will accumulate an enormous amount of merit and plant hundreds of thousands of roots of virtue.

source: འཇིག་རྟེན་པ་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་མཆོག་ཐོབ་པར་འགྱུར།
en: They will obtain all worldly and divine pleasures.

source: འཆི་བའི་དུས་ན་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་མངོན་སུམ་དུ་སྟོན་པར་འགྱུར་ཞིང་དབུགས་འབྱིན་པར་འགྱུར།
en: At the time of dying, they will see Noble Avalokiteśvara face-to-face and will be comforted by him.

source: ཤི་ནས་བདེ་བ་ཅན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་སྐྱེ་བར་འགྱུར།
en: After death, they will be reborn in the realm of Sukhāvatī.

source: སྒྲིབ་པ་ཐམས་ཅད་དང་བྲལ་ནས་ཚེ་རབས་བརྒྱ་སྟོང་ཕྲག་ལྔ་བཅུ་རྗེས་སུ་དྲན་པར་འགྱུར་རོ།
en: Purified of all obscurations, they will recall five hundred thousand former births.

source: །བྱང་ཆུབ་ཀྱི་སྙིང་པོའི་མཐར་ཐུག་གི་བར་དུ་སྐྱེ་བ་འདི་ཐ་མ་ཡིན་ཏེ།
en: Their birth in Sukhāvatī will be their last, and it will continue until they attain final realization.

source: འདི་མཐོང་བ་ཙམ་གྱིས་བསོད་ནམས་ཀྱི་ཕུང་པོ་དང་ལྡན་པར་འགྱུར་ན། །ལྷག་པར་མང་དུ་བྱེད་པ་ལྟ་ཅི་སྨོས་ཏེ།
en: If those who merely see this painting can accumulate so much merit, what need is there to mention those who worship it with great reverence?

source: དེ་ནི་ཕྱིར་མི་ལྡོག་པར་འགྱུར། བླ་ན་མེད་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ།
en: They will be known to be irreversibly established on the path to supreme awakening. “

source: །གལ་ཏེ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོའམ། དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མའམ། རྒྱལ་པོ་དང་། བློན་པོ་དང་།
en: If any son or daughter of noble family, a monk or a nun, a male or a female lay practitioner, a king, a royal minister, a member of the royal harem, or the first queen mindfully repeats the heart mantra of Amoghapāśa in front of the painting that has been executed according to procedure, honoring thus the noble lord Avalokiteśvara, they should know that this act will be multiplied one hundred thousand times.

source: བཙུན་མོའི་འཁོར་དང་བཅས་པའམ། བཙུན་མོ་དམ་པ་གང་ལ་ལ་ཞིག་གིས་རས་ཀྱི་སྐུ་གཟུགས་བསྒྲུབ་པར་བྱ་བ་དེའི་སྤྱན་སྔར། དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་དྲན་པར་བྱེད་ཅིང་། འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དེ་ལ་ཡང་མཆོད་པར་བྱེད་ན། དེས་ན་ཁྱོད་ཀྱིས་འདི་ལྟར་རིག་པར་བྱ་སྟེ།
en: It will be the same as if they performed the recitation procedure the same number of times.

source: དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་སྟོང་ཕྲག་བརྒྱ་འགྱུར་དུ་བཟླས་ཤིང་བཟླས་བརྗོད་ཀྱི་ཆོ་ག་ཆེན་པོ་བྱས་པ་ཡིན་ནོ། །གང་ཞིག་ཁྲོ་བོ་དོན་ཡོད་པའི་ཞགས་པ། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་མི་སྨྲ་བར་ལན་གསུམ་བཟླས་བརྗོད་བྱ་སྟེ། ཆུས་དབང་བསྐུར་ན་དེས་ན་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་བདག་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་ཐུག་གི་བར་དུ་དབང་བསྐུར་བར་འགྱུར་རོ། །སྙམ་དུ་དེ་ལྟར་ཤེས་པར་བྱའོ།
en: And if anyone mindfully repeats the mantra of Amogha­pāśa­krodha three times in front of the Blessed One without saying anything else, and then consecrates themselves, they should know that they receive consecration from all the buddhas and bodhisattvas.

source: །གང་གིས་དོན་ཡོད་པར་གྲུབ་པའི་ཆོ་ག་ཞིབ་མོ་ཆེན་པོའི་གཟུངས། འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་རས་ཀྱི་སྐུ་གཟུགས་ཀྱི་སྤྱན་སྔར་མངོན་སུམ་དུ་ཐལ་མོ་སྦྱར་ཏེ་འདུག་ནས་ལན་གསུམ་བཟླས་ཏེ།
en: They will then retain the dhāraṇī of the great ritual of Amoghasiddhi until the time of final realization. “

source: བསྐོར་བ་ལན་བདུན་བྱས་ལ་ཆུའི་ནང་དུ་མཆོད་ཡོན་དང་། ལྷ་བཤོས་དང་། བདུག་སྤོས་དང་། མེ་ཏོག་ཕུལ་ནས་ཕྱག་འཚལ་ལོ་ཞེས་སྨྲས་ན། དེས་ཁྱོད་ཀྱིས་འདི་ལྟར་ཤེས་པར་བྱ་སྟེ། གཟུངས་ཐམས་ཅད་སོ་སོར་ལན་སྟོང་ཕྲག་བརྒྱ་བཟླས་པར་འགྱུར་ཞིང་། དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་རྣམ་པར་གྲོལ་བའི་དཀྱིལ་འཁོར་གྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ཆེན་པོ་འདི་ལན་སྟོང་ཕྲག་བརྒྱ་བཟླས་པར་འགྱུར་རོ།
en: Whoever mindfully repeats the dhāraṇī of the great ritual of Amoghasiddhi in front of the painting of Noble Avalokiteśvara seven times with folded hands, circumambulates him clockwise seven times, offers him argha water for the feet, food, incense, and flowers, and bows to him should know that doing this is equivalent to mindfully repeating each and every dhāraṇī, one by one, one hundred thousand times, and repeating this Dharma discourse, this great maṇḍala of liberation that is the essence of Amoghapāśa, one hundred thousand times. “

source: །དོན་ཡོད་པའི་ཞགས་པའི་ཕྱག་རྒྱ་བྱས་ལ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་ཞལ་ལ་མིག་གཏད་དེ་ལག་པ་གཡས་གཡོན་གཉིས་སྦྱར་ལ། སྙིང་གར་གཞག་ཅིང་ཚུལ་འདིས་ཕྱག་རྒྱ་རེ་རེ་ནས་ལན་སྟོང་ཕྲག་བརྒྱ་བྱས་པར་འགྱུར་རོ། །བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོའམ། དགེ་སློང་ངམ། དགེ་སློང་མའམ།
en: If the vidyā holder displays the mudrā of Amoghapāśa in front of the painting of Noble Avalokiteśvara while looking him in the face, if he touches him with his right and left hands and then places his hands on his own heart, this is equivalent to displaying each and every mudrā one hundred thousand times.

source: དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མའམ། རྒྱལ་པོ་དང་། རྒྱལ་པོའི་བཙུན་མོ་དམ་པ་གང་ལ་ལ་ཞིག་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་འདི་བརྒྱ་སྟོང་ཕྲག་ཁྲི་བཟླས་བརྗོད་བྱ་བར་འདོད་པ་དང་། དེ་བཞིན་གཤེགས་པ་བརྒྱ་སྟོང་ཕྲག་ཁྲིས་དབང་བསྐུར་བར་འདོད་པ་དང་རྣམ་པར་གྲོལ་བའི་དཀྱིལ་འཁོར་མཐའ་དག་གི་ཆོ་ག་ཞིབ་མོ་འདི་རྫོགས་པར་ལན་བརྒྱ་སྟོང་ཁྲི་བཟླས་པར་འདོད་པ་དང་། དོན་ཡོད་པའི་ཞགས་པའི་ཕྱག་རྒྱ་འདི་ལན་བརྒྱ་སྟོང་ཕྲག་ཁྲི་བྱ་བར་འདོད་པ་དེས་རས་ཀྱི་སྐུ་གཟུགས་ལ་བརྩོན་པར་བྱ་སྟེ།
en: If, O Lord, a vidyā holder who is a son or daughter of noble family, a monk or a nun, a male or a female lay practitioner, a king or a queen, a member of the royal harem, or a distinguished lady of the royal court wants to perform worship equivalent to reciting this heart dhāraṇī of Noble Avalokiteśvara-Amoghapāśa one hundred thousand million times, receiving consecration from hundreds of thousands of millions tathāgatas, fully performing the entire ritual of Amoghapāśa, this maṇḍala of liberation, one hundred thousand million times, and displaying the mudrā of Amoghapāśa the same number of times, they should do the following. “

source: རས་ཀྱི་སྐུ་གཟུགས་སྔོན་དུ་བཞག་ནས་གནས་གཙང་ཞིང་དབེན་པར་གནས་སམ། འཆགས་སམ་དགོན་པའི་གནས་སམ། ཕུག་གམ། རིའི་རྩེ་མོའམ། གཙུག་ལག་ཁང་ངམ།
en: They should consecrate the painting and place it so as to face the viewer, in a place that is clean and free from distractions, such as a house, a walking path, a forest hermitage, a cave, a mountaintop, a monastery, or an ordinary house.

source: ཁང་པར་གཙང་སྦྲ་དང་བྱི་དོར་བྱ་སྟེ། བསེར་མོའི་ལྕི་བ་ལེགས་པར་མཉེས་ལ། བ་ལས་བྱུང་བ་ལྔ་དང་བསྲེས་ཏེ་བསྐུས་ལ་སྤོས་སྣ་ཚོགས་ཀྱི་བྱུག་པས་བྱུགས་ནས་རས་ཀྱི་སྐུ་གཟུགས་ཀྱི་སྤྱན་སྔར་ཙནྡན་དཀར་པོའི་དཀྱིལ་འཁོར་བྱས་ཏེ།
en: He should clean and tidy the place, smear the floor with dung that has been correctly obtained from a tawny cow, sprinkle it with the five products of the cow, and anoint it with various fragrant unguents.

source: གུར་གུམ་གྱིས་ཁྲུ་དོའི་ཚད་ཙམ་བྲིས་ལ་གླ་རྩི་དང་ག་བུར་གྱིས་མཆོད་པར་བྱའོ།
en: Using white sandalwood, he should draw a small maṇḍala in front of the painting that is two cubits in diameter, color it with saffron, and offer musk and camphor there. “

source: །དྲི་ཆབ་ཀྱི་བུམ་པ་དྲི་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་བཀང་སྟེ། རས་ཀྱི་མགུལ་ཆིངས་ཀྱིས་བཅིངས་ལ། དཀྱིལ་འཁོར་གྱི་དབུས་སུ་གཞག་པར་བྱ།
en: Having filled a jar with scented water and added various fragrant substances, the vidyā holder should place it in the very center of the maṇḍala and cover it with cloth.

source: མེ་ཏོག་དང་བདུག་སྤོས་དྲི་ཞིམ་པོ་དང་། མེ་ཏོག་གི་ཕྲེང་བ་ཉི་ཤུ་རྩ་གཅིག་གཞག་པར་བྱ།
en: He should place fragrant flowers, incense, a bali offering, and twenty-one flower garlands around it.

source: དྲི་ཆབ་ཀྱིས་བཀང་བ་བརྒྱད་ཕྱོགས་བཞིར་གཞག་པར་བྱ།
en: He should place eight earthenware vessels filled with fragrant water in the four cardinal directions.

source: འོ་མས་བཀང་བའི་སྣོད་བརྒྱད་གཞག་པར་བྱ། སྟེགས་བུའི་དྲུང་དུ་འོ་མས་བཀང་བའི་སྣོད་གཞག་པར་བྱ། འོ་ཐུག་དང་། སྦྱར་ཐུག་དང་། ཁཎྜ་ཁ་དྱ་དང་། འབྲས་ཆན་དང་། ལག་པན་དང་།
en: He should add another eight filled with milk, and in the spaces in between them another eight filled with milk-based sweetmeats such as sesame halva and so forth, as well as rice pudding, curd dishes, molasses, candies, and ghee.

source: བུ་རམ་དང་ཤ་ཁར་དང་། ཞུན་མར་གྱིས་བཀང་བའི་སྣོད་གཞག་པར་བྱ། ཨ་ག་རུ་ནག་པོ་དང་ཙནྡན་དཀར་པོ་དང་། ག་བུར་དང་། ཀུན་དུ་རུ་དང་།
en: Furthermore, he should add vessels with incense of black agarwood, white sandalwood, camphor, olibanum, pine resin, and flowers.

source: ཤི་རིབཱ་ས་ཀ་དང་། ཅུང་པེང་རྣམས་སྣོད་དང་བཅས་པ་བཞག་ནས། ཨ་ག་རུའི་ཡམ་སྲེག་ཤིང་གིས་སྦྱིན་སྲེག་བྱ། མེ་ཏོག་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པར་བྱ། མར་གྱི་མར་མེ་སུམ་ཅུ་རྩ་གཉིས་བལྟམ་པར་བྱའོ།
en: He should then offer a homa of agarwood sticks, decorate the place with various flowers, and light thirty lamps. “

source: །དེ་ནས་རིག་སྔགས་འཆང་གཙང་མས་གོས་གཙང་མ་བགོས་ཤིང་ཁྲུས་ལེགས་པར་བྱས་པས་ཚེས་བཅུ་བཞི་ནས་བཅྭ་ལྔའི་བར་དུ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་རས་ཀྱི་སྐུ་གཟུགས་ལ་མཆོད་པར་བྱའོ།
en: Thoroughly bathed and wearing clean clothes, he should perform the rite on the fourteenth through the fifteenth day of the lunar fortnight, making offerings in front of the painting of Noble Avalokiteśvara.

source: །དེའི་འོག་ཏུ་རིག་སྔགས་འཆང་གིས་ཁྲོ་བོའི་རྒྱལ་པོ་ལན་བདུན་བཟླས་ཏེ། དྲི་ཆབ་ཀྱིས་དབང་བསྐུར་བར་བྱ།
en: He should recite the Krodharāja mantra seven times and sprinkle himself with the scented water from the jar.

source: དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་ལན་ཉི་ཤུ་རྩ་གཅིག་བྱ།
en: He should display the mudrā of Amoghapāśa twenty-one times, and then, sitting cross-legged, he should silently repeat the heart mantra of Amoghapāśa while displaying the mudrā of recitation.

source: དེ་ནས་མི་སྨྲ་བར་སྐྱིལ་མོ་ཀྲུང་དུ་འདུག་སྟེ་བཟླས་བརྗོད་ཀྱི་ཕྱག་རྒྱ་བཅིངས་ལ་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་པར་བྱ་དེའི་འོག་ཏུ་དོན་ཡོད་པར་གྲུབ་པའི་རིག་སྔགས་ཀྱི་རྒྱལ་པོ་སྟོང་རྩ་བརྒྱད་བཟླས་པར་བྱས་ན།
en: He should repeat this mantra one hundred and eight times. After that, he should recite the sovereign vidyā of Amoghasiddhi one thousand and eight times. “

source: དེ་ནས་རས་ཀྱི་སྐུ་གཟུགས་ལས་འོད་ཟེར་བདུན་བྱུང་ནས་ཀུན་ཏུ་སྣང་བར་བྱས་ཏེ།
en: Seventy rays of light will subsequently issue forth from the painting, illuminating the space around it.

source: ལན་གསུམ་བསྐོར་བ་བྱས་ནས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་དཔྲལ་བའི་སྤྱན་དུ་ཞུགས་པར་འགྱུར་རོ།
en: They will circumambulate the painting clockwise three times and enter the forehead of Noble Avalokiteśvara through his eyes.

source: །ཞུགས་པ་ཙམ་གྱི་མོད་ལ་ས་ཆེན་པོ་གཡོ་བར་འགྱུར་ཞིང་རིག་སྔགས་འཆང་ཡང་སྙིང་དགའ་ཞིང་བ་སྤུ་ལྡང་བར་འགྱུར།
en: As soon as they enter, a great earthquake will be felt.

source: མདོག་མདངས་ཡོངས་སུ་དག་པར་འགྱུར།
en: The vidyā holder will experience goose bumps of joyous rapture, and his complexion will become very bright.

source: འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་མཆོག་སྦྱིན་པའི་ཕྱག་གི་སོར་མོ་ལས་ལྷའི་ཆུ་འཛག་པར་འགྱུར། ཞབས་གཉིས་ལས་འོ་མ་འཛག་པར་འགྱུར།
en: Divine water will issue forth from the fingers of the hand of Noble Avalokiteśvara that displays the boon-granting mudrā, and milk will flow from his feet.

source: དོན་ཡོད་པའི་ཞགས་པའི་ཕྱག་འབར་བར་འགྱུར། ཕྱག་ན་པདྨའི་པདྨ་ལོ་མ་གཡོ་བར་འགྱུར། རྩེ་གསུམ་གཡོ་བར་འགྱུར་ཞིང་ལེགས་སོ་ཞེས་བྱ་བའི་སྒྲ་འབྱུང་བར་འགྱུར་ཏེ།
en: The unfailing noose in his hand will blaze with light, the lotus petals on the lotus in his hand will quiver, the trident will blaze with light, and the following words of approval will be heard: ‘Good!

source: རིགས་ཀྱི་བུ་ལེགས་སོ་ལེགས་སོ།
en: Good, O son of noble family!

source: །ཁྱོད་ཀྱིས་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་གྲུབ་ཀྱིས་ལས་ཐམས་ཅད་བྱོས་ཤིག་ཁྱོད་ཀྱིས་དོན་ཡོད་གྲུབ་པའི་ཆོ་ག་ཞིབ་མོའི་རྒྱལ་པོ་ཆེན་པོའི་དམ་པ་གྲུབ་པོ་ཞེས་ནས།
en: You have accomplished the heart essence of Amoghapāśa! You can perform all activities. You have won the supreme accomplishment of the great sovereign ritual of Amoghasiddhi.’ “

source: དེ་ནས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་རང་གིས་གཟུགས་སྟོན་པར་འགྱུར་རོ། །འདོད་པ་ཐམས་ཅད་ཀྱི་མཆོག་སྦྱིན་པར་མཛད་དོ།
en: Noble Avalokiteśvara will subsequently appear to the vidyā holder in person and grant him every desirable boon.

source: །འདི་ནི་གྲུབ་པའི་མཆོག་བླ་ན་མེད་པ་སྟེ།
en: This supreme accomplishment is incomparable.

source: མ་བསྒྲུབས་པར་ལས་བྱེད་པའོ།
en: The vidyā holder, even if he is not fully realized himself, will accomplish all activities. “

source: །དེ་ནས་དབང་དུ་བྱ་བར་འདོད་པས་མེ་ཏོག་པདྨ་ལ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་ལ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་ཕུལ་ཏེ།
en: If the vidyā holder wants to perform an act of enthrallment, he should incant a lotus one hundred and eight times and place it in the hand of Noble Avalokiteśvara.

source: གང་གི་མིང་ནས་བརྗོད་པ་དེ་དབང་དུ་འགྱུར་རོ།
en: The person whose name the vidyā holder pronounces will become enthralled.

source: །སྣ་མའི་མེ་ཏོག་ལ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་ཏེ། འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་ཕུལ་ལ།
en: He can also offer a jasmine flower incanted one hundred and eight times to Noble Avalokiteśvara.

source: ཡང་ལན་བདུན་བཟླས་ནས་མེ་ཏོག་སྙིང་པོ་བླངས་ནས་གང་ལ་བྱིན་པ་དེ་དབང་དུ་འགྱུར་རོ།
en: Then, having further incanted the same flower mentally seven times, he should retrieve it. The person to whom he gives this flower will become enthralled.

source: །གདོན་གྱིས་ཟིན་པ་ལ་བྱིན་ན་གདོན་ཐམས་ཅད་ལས་ཡོངས་སུ་གྲོལ་བར་འགྱུར་རོ།
en: If he gives the flower to someone suffering from seizures, the afflicted person will be cured.

source: །ནད་ཀྱིས་ཐེགས་པ་ལ་བྱིན་ན་ནད་ཐམས་ཅད་ཡོངས་སུ་གྲོལ་བར་འགྱུར་རོ།
en: Likewise, if he gives it to a diseased person, that person will be cured of all disease. “

source: །རྒྱལ་པོའི་སྒོར་གཏོར་ན་རྒྱལ་པོ་བཙུན་མོའི་འཁོར་དང་བཅས་པ་དབང་དུ་འགྱུར་རོ།
en: If the vidyā holder casts the flower at the gate of the royal place, the king, his harem, and his retinue will fall under his thrall.

source: །མི་རོ་བསྲེགས་པའི་སའི་སྟེང་དུ་གཏོར་ན། སེམས་ཅན་དེ་སེམས་ཅན་དམྱལ་བ་ལས་ཡོངས་སུ་གྲོལ་བར་འགྱུར་རོ།
en: If he casts it upon a funeral pyre, the person being cremated will be saved from hell.

source: །མནར་མེད་པ་ན་གནས་པའི་སེམས་ཅན་ལ་གཏོར་ན་སྐད་ཅིག་དེ་ལ་ཡོངས་སུ་གྲོལ་བར་འགྱུར།
en: If he casts it for the sake of a being who is in the Avīci hell, that being will be instantly freed.

source: ཉལ་བའི་སྔས་སུ་བཞག་ན་རྨི་ལམ་ཆེན་པོ་མཐོང་བར་འགྱུར་རོ། །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་སྐུ་སྟོན་པར་མཛད་ཅིང་ཡིད་དུ་འོང་བ་ཐམས་ཅད་གསུང་བར་འགྱུར་རོ།
en: If he places it at the head of the bed, he will have portentous dreams, and Noble Avalokiteśvara will appear to him and say pleasant things.

source: །སྐྱེས་པའམ་བུད་མེད་གང་གི་སྟེང་དུ་གཏོར་བ་དེ་དབང་དུ་འགྱུར་ཞིང་གྲིབ་མ་བཞིན་ཕྱི་བཞིན་འབྲང་བར་འགྱུར་རོ།
en: Whomever he casts the flower upon, whether a woman or a man, will fall under his thrall and follow him like a shadow.

source: །རྒྱལ་པོའི་སྟེང་དུ་གཏོར་ན་དེ་བཞིན་དུ་འགྱུར་རོ།
en: If he casts the flower upon a king, the king will become his servant.

source: །ལྷའི་གཟུགས་བརྙན་གྱི་སྟེང་དུ་བཞག་ན་འགུགས་པར་འགྱུར་ཞིང་ལས་ཐམས་ཅད་བྱེད་པར་འགྱུར་རོ།
en: If he places the flower near an image of a deity, the deity will be summoned and will perform all the vidyā holder’s tasks. “
